[{
  "title": "No Cow Vegan Protein Bars, Upgraded Brand Sampler Pack | 20g Plant Based Protein, Gluten Free, Dairy Free, Soy Free, Keto Friendly, Low Sugar, High Fiber Snack Bars | Pack of 12",
  "asin": "B084JKVSP3",
  "brand": "No Cow",
  "stars": 4,
  "reviewsCount": 12543,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51MBjw6ZzaL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 36.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B084JKVSP3"
},
{
  "title": "RXBAR Protein Bars, Snack Bars, Variety Pack (10 Count)",
  "asin": "B0DJMZC68J",
  "brand": "RXBAR",
  "stars": 4.4,
  "reviewsCount": 880,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41uHiarqvJL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Simple, delicious ingredients make RXBAR protein bars and RXBAR Nut Butter and Oat protein bars a satisfying way to fuel your day. This variety pack includes 7 delicious RXBAR flavors and 3 soft yet crispy RXBAR Nut Butter and Oat flavors. Discover a tasty variety, each one high in protein and filled with ingredients you can recognize. The assortment includes RXBAR Chocolate Sea Salt, Blueberry, Coconut Chocolate, Peanut Butter, Strawberry, Peanut Butter Chocolate, and Vanilla Almond; Also includes RXBAR Nut Butter and Oat Honey Cinnamon Peanut Butter, Blueberry Cashew Butter, and Dark Chocolate Peanut Butter. Enjoy the taste of real ingredients that will crush any sweet cravings you have during the day. They're wholesome goodness worth snacking on. On your way to the gym, in the office, or paired with your morning cup of joe, stock your pantry and grab a bar no matter where your day takes you. Improve your routine with RXBAR and RXBAR Nut Butter and Oat protein bars.​",
  "price": {
    "value": 18.78,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DJMZC68J"
},
{
  "title": "Quest Nutrition Crispy Cookies & Cream Hero Protein Bar, 18g Protein, 1g Sugar, 3g Net Carb, Gluten Free Protein Snack, Keto Friendly, 12 Count",
  "asin": "B092CRNT6M",
  "brand": "Quest",
  "stars": 4.6,
  "reviewsCount": 10391,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81om2Qb6AKL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Due to global supply chain issues, Quest™ recently reformulated some of its products to contain soy lecithin and/or vegetable oil including soybean which is considered an allergen. The small amount contained within the product will not change the quality, flavor or texture of the product. We remain committed to using the high quality dairy-based proteins to help give you the amino acids you need.",
  "price": {
    "value": 26.24,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B092CRNT6M"
},
{
  "title": "Quest Nutrition Overload Protein Bars, Chocolate Explosion, 20g Protein, 1g Sugar, 3g Net Carbs, Gluten Free, 12 Count",
  "asin": "B0DS6M7H36",
  "brand": "Quest",
  "stars": 4.6,
  "reviewsCount": 840,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71WbzmrObSL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Cheat on basic snacks with protein hacks. New Quest™ Overload Protein Bars are covered, delightfully drizzled, and packed with more of the chunks, chips & pieces you love – while keeping sugar on the DL. Our New Chocolate Explosion flavor is loaded with amazing ingredients like dark chocolatey chips, milk chocolatey chips & chunks, and chocolatey cookie pieces in a fudgy, chocolate flavored base. Then we top it off with a milk chocolatey coating and chocolate flavored sprinkles over a milk chocolatey drizzle. And thanks to 20g of protein, 3g of net carbs and 1g of sugar* it’s the high protein bar that’s made to dazzle your taste buds and support your nutritional goals. Pack a few in your gym bag, office drawer, or home pantry for whenever you want a tasty protein boost. Stock up on these low sugar*, gluten free bars and all your other Quest favorites, from cookies and chips - to shakes, candies, and more. *Per serving. See Nutrition Facts for Calories and Saturated Fat Contents. 1g Sugar, Including 0g added sugars per serving. Not a low-calorie food.",
  "price": {
    "value": 25.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DS6M7H36"
},
{
  "title": "ONE Protein Bars, Blueberry Cobbler, Gluten Free with 20g Protein and 1g Sugar, Pantry Staples, 2.12 oz (12 Count)",
  "asin": "B01N183BAD",
  "brand": "ONE",
  "stars": 4.4,
  "reviewsCount": 25533,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51odcpHuE2L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Enjoy the delectable flavors of sweet, juicy blueberries and flaky pie crust without spending hours in the kitchen. Fuel your workout or your work day with the power of ONE Blueberry Cobbler Flavored Protein Bars. Each gluten free protein bar is packed full of blueberry cobbler flavor complete with 20 grams of protein and 1 gram of sugar. Whether you need a quick option for breakfast or lunch or want a sweet treat after dinner or a tough workout, these protein bars are up to the task. This is not your grannie's cobbler! Never be caught empty-handed after a workout again! Stock your pantry, backpack and desk drawer with a handful of ONE protein bars packed full of sweet and fruity blueberry cobbler flavor. Grab a bar on your way out of the house, whether you're headed on a hike, to a sports game or just to run some errands. Feeling generous? Share the love and treat friends, family or even your gym buddy to 20 grams of protein, 1 gram of sugar and delicious flavor with ONE blueberry cobbler flavored gluten free protein bars. No matter where your day takes you, you can tackle it head on with a protein packed ONE bar.",
  "price": {
    "value": 24.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B01N183BAD"
},
{
  "title": "Orgain Organic Vegan Protein Bars, Chocolate Brownie - 10g Plant Based Protein, Low Calorie Healthy Snacks, No Lactose or Soy Ingredients, Gluten Free, Non-GMO - 1.41 Oz (Pack of 12)",
  "asin": "B088SXRRLK",
  "brand": "Orgain",
  "stars": 4.2,
  "reviewsCount": 7072,
  "thumbnailImage": "https://m.media-amazon.com/images/I/817Qv6dOt3L._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "For those in need of a protein bar that’s delicious as it is nutritious, look no further Here at Orgain, we’re serious about good, clean nutrition, and when we say “good,” we mean it in every sense of the word! It can’t just be good for you, it has to taste GOOD too (great actually)! That’s why we worked relentlessly to create our Organic Protein Snack bars. Conveniently portable and crafted to be irresistibly delicious, every bar is packed with 10 grams of plant-based protein, 150 calories, 6g prebiotic + fiber, and made with our high-quality ingredients without any artificial flavors, sweeteners, or preservatives. Oh, they’re also certified USDA Organic, gluten free, vegan, non-GMO, and have no dairy or soy ingredients. Whether you’re a busy professional, parent, athlete, or anyone in need of a tasty anytime snack, we made these to help you take on whatever life decides to throw at you. Simply put, these bars are the real deal and are available in six enticing flavors that are sure to satisfy any taste buds: Chocolate Chip Cookie Dough, Peanut Butter Chunk, Peanut Butter and Chocolate Brownie. Good, clean nutrition ready for you to take it on the go, whenever and wherever you need it.",
  "price": {
    "value": 13.69,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B088SXRRLK"
},
{
  "title": "Simply Protein - Crispy Vegan Protein Bars Variety Pack, 3 Flavors - Plant Based, Protein Snacks - 13g Protein, 2g Sugar, 7g Fiber - Gluten Free, Non GMO, Kosher - 12 Bars",
  "asin": "B09LMS1MCG",
  "brand": "Simply Protein",
  "stars": 4.1,
  "reviewsCount": 2638,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51Da+mVHERL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": null,
  "price": {
    "value": 18.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09LMS1MCG"
},
{
  "title": "RXBAR Protein Bars, Protein Snack, Snack Bars, Chocolate Sea Salt, 18.3oz Box (10 Count)",
  "asin": "B07GX1MDWW",
  "brand": "RXBAR",
  "stars": 4.4,
  "reviewsCount": 11713,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41lumvRPwCL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Simple, delicious ingredients make RXBAR protein bars a satisfying way to fuel your day. These wholesome chocolate sea salt protein bars are filled with ingredients you can recognize. Each snack bar is made with egg whites for protein, crunchy almonds or cashews, with dates to bind it all together, and no B.S. Enjoy the taste of simple ingredients that will crush any sweet cravings you have during the day; Just the right amount to fill you up, each serving contains 12g of protein (20% daily value), is gluten free, and ready to help you take on the day. Enjoy wholesome goodness worth snacking on. On your way to the gym, in the office or paired with your morning cup of joe, improve your daily routine with RXBAR Chocolate Sea Salt protein bars.​",
  "price": {
    "value": 16.98,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07GX1MDWW"
},
{
  "title": "NuGo Dark Chocolate Pretzel and Sea Salt, 12g Protein Bar, Vegan, Gluten Free, Non-GMO, Kosher Pareve, 24 Count",
  "asin": "B07V7HKP8N",
  "brand": "NuGo",
  "stars": 4.6,
  "reviewsCount": 6245,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81OsjuUmdvL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Every NuGo Dark bar is dipped in decadent, real Dark Chocolate. They have the nutrition you need with the flavor you love All of our NuGo Dark bars are gluten free, Vegan, out Kosher Pareve, and have 10g-13g of quality protein.",
  "price": {
    "value": 39.72,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07V7HKP8N"
},
{
  "title": "Perfect Bar Mini Dark Chocolate Chip Peanut Butter Protein Bar, Organic, 8 count, .88 oz",
  "asin": "B096H8LPP2",
  "brand": "Perfect Bar",
  "stars": 4.7,
  "reviewsCount": 3944,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51UzEtzx5PL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "If you’re looking for a delicious and nutritious snack to tide you over before you enter the hangry zone, reach for a Perfect Bar Mini Dark Chocolate Chip Peanut Butter Protein Bar. Perfect Bar’s original family protein bar recipe in a mini size loaded with organic dark chocolate chips and a touch of sea salt, these Non-GMO Project Verified, low-glycemic, gluten-free snacks are made with organic peanut butter and organic honey and contain 6 grams of whole food protein and 130 calories per mini protein bar. Your body will thank you for the vitamins, minerals, and antioxidants from 20+ organic superfoods in these kosher snacks made with no sugar alcohols and no artificial preservatives, colors, or flavors. For people who desire soy free protein bars, Perfect Bar makes it easy to find clean eating snacks that taste great! Conquer your day with these between-meal bars that are best stored in the fridge but stable enough to survive a weekend trip or errand-running. Too cool for the snack aisle, these refrigerated protein snack packs of 8 mini bars are ideal for anyone wanting delicious pre-workout snacks, hiking snacks, or office snacks. Packed with perfect, they’re an abundance of goodness to nourish all that you are.",
  "price": null,
  "url": "https://www.amazon.com/dp/B096H8LPP2"
},
{
  "title": "ONE Protein Bars, Reese's Peanut Butter Lovers, Gluten Free with 18g Protein and 3g Sugar, Pantry Staples, 2.12 oz (12 Count)",
  "asin": "B0CVNCJKJJ",
  "brand": "ONE",
  "stars": 4.3,
  "reviewsCount": 2588,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51MD3hBj-qL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Calling all peanut butter lovers it's time to go nuts! Fuel your workout or your work day with the power of ONE REESE'S Peanut Butter Lovers Flavor Inspired Protein Bars. Each gluten free protein bar is packed full of peanut butter flavor complete with 18 grams of protein and 3 grams of sugar. Whether you need a quick option for breakfast or lunch or want a sweet treat after dinner or a tough workout, these protein bars are up to the task. Never be caught empty-handed after a workout again! Stock your pantry, backpack and desk drawer with a handful of ONE protein bars packed full of sweet and salty REESE'S peanut butter flavor. Grab a bar on your way out of the house, whether you're headed on a hike, to a sports game or just to run some errands. Feeling generous? Share the love and treat friends, family or even your gym buddy to 18 grams of protein, 3 grams of sugar and delicious flavor with ONE REESE'S peanut butter flavored gluten free protein bars. No matter where your day takes you, you can tackle it head on with a protein packed ONE bar.",
  "price": {
    "value": 24.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CVNCJKJJ"
},
{
  "title": "Orgain Organic Vegan Protein Bars, Peanut Butter Chocolate Chunk - 10g Plant Based Protein, Low Calorie Healthy Snacks, No Lactose or Soy Ingredients, Gluten Free, Non-GMO - 1.41 Oz (Pack of 12)",
  "asin": "B01HNTBGP8",
  "brand": "Orgain",
  "stars": 4.3,
  "reviewsCount": 7447,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81KBFlFNLpL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "For those in need of a protein bar that’s delicious as it is nutritious, look no further Here at Orgain, we’re serious about good, clean nutrition, and when we say “good,” we mean it in every sense of the word! It can’t just be good for you, it has to taste GOOD too (great actually)! That’s why we worked relentlessly to create our Organic Protein Snack bars. Conveniently portable and crafted to be irresistibly delicious, every bar is packed with 10 grams of plant-based protein, 150 calories, 6g prebiotic + fiber, and made with our high-quality ingredients without any artificial flavors, sweeteners, or preservatives. Oh, they’re also certified USDA Organic, gluten free, vegan, non-GMO, and have no dairy or soy ingredients. Whether you’re a busy professional, parent, athlete, or anyone in need of a tasty anytime snack, we made these to help you take on whatever life decides to throw at you. Simply put, these bars are the real deal and are available in six enticing flavors that are sure to satisfy any taste buds: Chocolate Chip Cookie Dough, Peanut Butter Chunk, Peanut Butter and Chocolate Brownie. Good, clean nutrition ready for you to take it on the go, whenever and wherever you need it.",
  "price": {
    "value": 13.69,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B01HNTBGP8"
},
{
  "title": "ALOHA Organic Plant Based Protein Bar MINIS |Coconut Chocolate Almond | 20 Count, 24g Bars | Vegan, Low Sugar, Gluten Free, Paleo, Low Carb, Non-GMO, Stevia Free, Soy Free, No Sugar Alcohols",
  "asin": "B09T5WFH91",
  "brand": "ALOHA",
  "stars": 4.5,
  "reviewsCount": 862,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41qtqv6ujrL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "ALOHA Organic Plant Based Protein Bar MINIS |Coconut Chocolate Almond | 20 Count, 24g Bars | Vegan, Low Sugar, Gluten Free, Paleo, Low Carb, Non-GMO, Stevia Free, Soy Free, No Sugar Alcohols",
  "price": {
    "value": 24.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09T5WFH91"
},
{
  "title": "Power Crunch Whey Protein Bars, High Protein Snacks with Delicious Taste, Strawberry Cream, 1.4 Ounce (12 Count)",
  "asin": "B08STVX584",
  "brand": "Power Crunch",
  "stars": 4.4,
  "reviewsCount": 6501,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41ijIlKFE+L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Power Crunch Bars are the perfect protein snacks for home or on the go. With 12-14 grams of protein and only 5-8 grams of sugar, these delicious-tasting whey protein energy bars are the ideal snacks. Power Crunch makes the perfect High Protein Snacks with high-DH hydrolyzed Proto Whey Protein. Easier to digest protein makes Power Crunch the pinnacle of smart protein nutrition! Our wafer cookie and delicious flavor assortment will make you forget you’re eating a high-protein bar.",
  "price": {
    "value": 16.01,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B08STVX584"
},
{
  "title": "ALOHA Organic Plant Based Protein Bars, Peanut Butter Cup , 1.98-Ounce Bars, (Pack of 5)",
  "asin": "B0BXC1Z68L",
  "brand": "ALOHA",
  "stars": 4.8,
  "reviewsCount": 82,
  "thumbnailImage": "https://m.media-amazon.com/images/I/511s9wMVhbL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "At ALOHA, we believe that plants are the ultimate source of nourishment, and that real foods should be really convenient. So when you’re looking for a great tasting, organic, plant-based protein boost, we’ve got you covered. ALOHA protein bars use simple, organic ingredients that are naturally packed with the tools your body needs to do its best: protein, iron, fiber, and healthy fats. With 14g clean protein and only 5g of natural sugar, ALOHA’s protein bars are the perfect, healthy snack to tide you over. Our thoughtfully selected, plant-based protein is sourced from a balanced mix of organic pumpkin seed and organic brown rice, to deliver steady energy that will carry you through the day without the dreaded sugar crash. ALOHA’s organic, plant-based products are vegan, non-GMO, gluten-free, soy-free, dairy-free lactose-free, stevia-free, high protein, Kosher Certified and USDA certified organic. ALOHA checks the all the boxes, so you can enjoy a tasty, nutritious snack without hesitation. All of our protein bars and protein products are made free of artificial ingredients and free of sugar alcohols, because we know that what you eat and how you feel are intimately connected. ALOHA’s organic, plant-based Chocolate Mint protein bars use a short line of organic, whole-food ingredients that are delicious and self-explanatory: like real, organic dark chocolate, organic cashew butter, and organic peppermint oil. The perfect protein bar for when you’re between meetings, warming up for the gym or cooling down, on the road, taking a pit-stop on your weekend cycle, or looking for an easy, nutritious option at home. The search for a healthy, satisfying, go-to snack is over: sit back and enjoy a great tasting, rejuvenating ALOHA protein bar.",
  "price": null,
  "url": "https://www.amazon.com/dp/B0BXC1Z68L"
},
{
  "title": "RXBAR Protein Bars, Protein Snack, Snack Bars, Variety Pack, 18.3oz Box (10 Count)",
  "asin": "B0CND6BGC6",
  "brand": "RXBAR",
  "stars": 4.4,
  "reviewsCount": 1090,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41DJBdM3TwL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Simple ingredients make RXBAR protein bars a delicious way to help fuel your day. These protein bars are filled with ingredients you can recognize. This variety pack includes Peanut Butter, Peanut Butter Chocolate, and Chocolate Sea Salt flavors. Each snack bar is made with egg whites for protein, crunchy nuts, with dates to bind it all together. Enjoy the taste of simple ingredients that will crush any peanut butter or chocolate cravings you have during the day; Just the right amount to help fill you up, each serving contains 12g of protein (up to 20% daily value), is gluten free, and ready to help you take on the day. Enjoy goodness worth snacking on. On your way to the gym, in the office or paired with your morning cup of joe, improve your daily routine with RXBAR protein bars.​",
  "price": {
    "value": 16.98,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CND6BGC6"
},
{
  "title": "Quest Nutrition Cookies & Cream Protein Bars, 21g Protein, 4g Net Carbs, 1g Sugar, High Fiber, Gluten Free, Keto Friendly, 4 Count",
  "asin": "B00U1U2SEU",
  "brand": "Quest",
  "stars": 4.3,
  "reviewsCount": 1895,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41CTBOyPLqL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Succumb to chunky cookie bits. Quest Cookies & Cream Protein Bars feature chocolatey sandwich cookie pieces and white chocolatey chunks for a delicious taste that reminds you of cookies & cream ice cream. And with 21g of protein, 1g of sugar, and 4g of net carbs per bar* they’re the ultimate cookies & cream cheat code. Satisfy your cravings with the wonderfully sweet & creamy flavor of cookies & cream without ignoring your protein goals. Keep a few in your gym bag, desk drawer, or pantry for whenever you want a tasty protein snack. Be sure to stock up on these cookies & cream protein bars and all your other Quest favorites, from cookies and chips - to shakes, candies, and more. Surrender to satisfaction and set your taste buds free. It’s basically cheating. *Per Serving. See Nutrition Facts for Calories Content. 7 g of Total Fat. Net Carbs = Total Carbs - Fiber - Sugar Alcohols.",
  "price": {
    "value": 9.47,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00U1U2SEU"
},
{
  "title": "Pure Protein Bars, High Protein, Nutritious Snacks to Support Energy, Low Sugar, Gluten Free, Chewy Chocolate Chip, Pack of 36",
  "asin": "B0CQ3Z1ZQ9",
  "brand": "Pure Protein",
  "stars": 4.2,
  "reviewsCount": 173,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41AUPeryNgL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Pure Protein Chewy Chocolate Chip Protein Bars are delicious high protein snacks that support lean muscle and strength. Each chewy chocolate chip protein bar contains 20 grams of protein, 200 calories and 3 grams of sugar, for a great tasting and gluten free protein snack. Additionally, these high protein bars support your active lifestyle so toss them in your gym bag for a protein snack you can eat pre workout, post workout or on the go during a busy day. With tasty chewy chocolate chip flavor, it's easy to enjoy a Pure Protein bar any time of day. Pure Protein is proud to offer low sugar(1) protein bars with great taste. (1) Pure Protein products contain 5g sugar or less.",
  "price": {
    "value": 49.1,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CQ3Z1ZQ9"
},
{
  "title": "CLIF BUILDERS Protein Bars - Chocolate Peanut Butter Flavor - 20g Plant Based Protein - Gluten Free - Non-GMO - Low Glycemic - No Artificial Sweeteners - Value Pack, 2.4 oz. (12 Count)",
  "asin": "B09QHBBGJT",
  "brand": "CLIF BUILDER'S",
  "stars": 4.5,
  "reviewsCount": 3729,
  "thumbnailImage": "https://m.media-amazon.com/images/I/515opWZjWKL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "CLIF BUILDERS plant based protein bars are designed to fuel hardworking bodies before or after tough workouts, whether you’re at the gym, on the court, or on the track. These high protein bars are packed with 20g of complete plant protein*, including essential amino acids to help support, rebuild, and repair muscles, our gluten free protein bars work as hard as you do to build something great. These plant protein bars are also non-GMO, gluten free, and low glycemic with no high-fructose corn syrup or artificial flavors for a powerful (and tasty) addition to your pre-workout and post-workout recovery regimen. *See nutrition for saturated fat content.",
  "price": {
    "value": 19.98,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09QHBBGJT"
},
{
  "title": "KIND Protein MAX Variety Pack, High Protein Bars, Keto Snacks, 1g Sugar, 20g Protein, (6) Crispy Chocolate Peanut Butter (6) Sweet & Salty Caramel Crisp, 12 Count Pack",
  "asin": "B0FHMLH6Q9",
  "brand": "KIND",
  "stars": 4.5,
  "reviewsCount": 160,
  "thumbnailImage": "https://m.media-amazon.com/images/I/516Vg1fteQL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Looking for a snack that is an excellent source of protein, high fiber, and keto friendly? Introducing KIND Protein MAX Snack Bars. Protein Max bars are individually wrapped, gluten free, and contain 20g of protein, 0g added sugar*, and 1g of total sugar. These ready to eat high protein snacks are not just about hitting your protein goals; they're a delicious celebration of real ingredients, like our number one ingredient, nutrient-dense peanuts. Kickstart your busy mornings with the balanced nutrition and convenience of KIND Protein MAX bars! Your perfect on-the-go protein bar snack that is high in fiber and deliciously satisfying. From conquering hiking trails to refueling post-workout, skip the trail mix and opt for KIND’s 250 calorie KIND Protein Max snack bars to jump start your adventure-filled day. Embrace the delectable taste of chocolate combined with heart healthy peanuts in KIND Protein MAX keto friendly protein bar. Join us in creating a kinder AND healthier world—one act, one snack at a time. Healthy snacks are smarter snacks. Snack KIND! (Not a Low Calorie Food. See Nutrition Information For Calorie, Sugar, Fat & Sat Fat Content. Contains 14g Fat Per Bar)",
  "price": {
    "value": 18.54,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0FHMLH6Q9"
},
{
  "title": "KIND Protein MAX Crispy Chocolate Peanut Butter Snack Bars, 20g of Protein, Keto Friendly, 1g of Sugar Per Bar, Gluten Free, 12 Count Box",
  "asin": "B0CM77RXJN",
  "brand": "KIND",
  "stars": 4.3,
  "reviewsCount": 991,
  "thumbnailImage": "https://m.media-amazon.com/images/I/510c2RDz3fL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Looking for a snack that is an excellent source of protein, high fiber, and keto friendly? Introducing KIND Protein MAX Crispy Chocolate Peanut Butter Snack Bars. Protein Max bars are individually wrapped, gluten free, and contain 20g of protein, 0g added sugar*, and 1g of total sugar. These ready to eat high protein snacks are not just about hitting your protein goals; they're a delicious celebration of real ingredients, like our number one ingredient, nutrient-dense peanuts. Kickstart your busy mornings with the balanced nutrition and convenience of KIND Protein MAX bars! Your perfect on-the-go protein bar snack that is high in fiber and deliciously satisfying. From conquering hiking trails to refueling post-workout, skip the trail mix and opt for KIND’s 250 calorie KIND Protein Max snack bars to jump start your adventure-filled day. Embrace the delectable taste of chocolate combined with heart healthy peanuts in KIND Protein MAX keto friendly protein bar. Join us in creating a kinder AND healthier world—one act, one snack at a time. Healthy snacks are smarter snacks. Snack KIND! (Not a Low Calorie Food. See Nutrition Information For Calorie, Sugar, Fat & Sat Fat Content. Contains 13g Fat Per Bar)",
  "price": {
    "value": 22.68,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CM77RXJN"
},
{
  "title": "TRUBAR Vegan Protein Bar, Whole Lotta Macchiato, Gluten Free, Plant Based Protein, Dairy Free, Non GMO, Soy Free, No Sugar Alcohols, 12G Protein, 12G Fiber, 23G Carb, On the Go Snack Bars, 1 CT",
  "asin": "B0D47VTP9X",
  "brand": "TRUWOMEN",
  "stars": 4.4,
  "reviewsCount": 62,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41Fyt2NnE4L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": null,
  "price": null,
  "url": "https://www.amazon.com/dp/B0D47VTP9X"
},
{
  "title": "MUSASHI High Protein Bar, 45g Protein, <1g Total Sugars, Dark Chocolate & Salted Caramel, Post Workout and Protein Snack On The Go, 12 Pack of 3.2oz (90g) Bars",
  "asin": "B0CYDSQWHQ",
  "brand": "MUSASHI",
  "stars": 4,
  "reviewsCount": 848,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51UvkP3KqLL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 41.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CYDSQWHQ"
},
{
  "title": "Kind, Bar Protein Breakfast Peanut Butter Banana Dark Chocolate 6 Count, 10.58 Ounce",
  "asin": "B0BCH583WK",
  "brand": "KIND",
  "stars": 4.6,
  "reviewsCount": 8969,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51glC4DmOML._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "KIND Breakfast bars are a wholesome snack made with 100% whole grains for sustained energy. KIND breakfast bars are made with five super grains, oats, buckwheat, millet, amaranth and quinoa - for a chewy, soft baked addition to your breakfast. These KIND bars come in individually wrapped and are perfect for convenient, on-the-go, gluten free snacks. Each two-bar pack has at least one full serving of whole grains. KIND Peanut Butter Banana Dark Chocolate Breakfast Protein bars help provide sustained energy from whole grains* (16g per serving). Made with quality, wholesome ingredients, these gluten free breakfast bars contain 16 grams of whole grains per serving and 0 grams of trans fat. These delicious snacks are Non-GMO Project Verified. Healthy snacks are smarter snacks. Snack KIND!",
  "price": {
    "value": 4.98,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0BCH583WK"
},
{
  "title": "ALOHA Organic Plant Based Protein Bars - Chocolate Coconut Almond, Vegan, Low Sugar, Gluten-Free, Low Carb, Non-GMO, No Stevia, No Erythritol - 12 Count (Pack of 1)",
  "asin": "B08P15V21R",
  "brand": "ALOHA",
  "stars": 4.4,
  "reviewsCount": 23833,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51+6ZlXeSjL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "At ALOHA, we believe that plants are the ultimate source of nourishment, and that real foods should be really convenient. So when you’re looking for a great tasting, organic, plant-based protein boost, we’ve got you covered. ALOHA protein bars use simple, organic ingredients that are naturally packed with the tools your body needs to do its best: protein, iron, fiber, and healthy fats. With 14g clean protein and only 4g of natural sugar, ALOHA’s protein bars are the perfect, healthy snack to tide you over. Our thoughtfully selected, plant-based protein is sourced from a balanced mix of organic pumpkin seed and organic brown rice, to deliver steady energy that will carry you through the day without the dreaded sugar crash. ALOHA’s USDA Certified Organic, plant-based products are Vegan Certified, Non-GMO Project Verified, gluten-free, soy-free, dairy-free (lactose-free), stevia-free, high protein, and Kosher Certified. ALOHA checks the all the boxes, so you can enjoy a tasty, nutritious snack or meal replacement without hesitation. All of our protein bars and protein products are made free of artificial ingredients and free of sugar alcohol sweeteners, because we know that what you eat and how you feel are intimately connected. ALOHA’s organic, plant-based Coconut Chocolate Almond protein bars use a short line of organic, whole-food ingredients that are delicious and self-explanatory: like real, organic chocolate chips, organic coconut, organic almonds, organic roasted pumpkin seeds, organic brown rice protein, organic vanilla extract and sea salt. The perfect protein bar for when you’re between meetings, warming up for the gym (or cooling down!), on the road, taking a pit-stop on your weekend cycle, or looking for an easy, nutritious option at home. The search for a healthy, satisfying, go-to snack is over: sit back and enjoy a great tasting, rejuvenating ALOHA protein bar.",
  "price": {
    "value": 22.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B08P15V21R"
},
{
  "title": "CLIF BUILDERS Protein Bars - OREO-Flavored - 20g Plant Based Protein - Gluten Free - Non-GMO - Low Glycemic - No Artificial Sweeteners - 2.4 oz. (12 Pack)",
  "asin": "B0DZXJ7LJG",
  "brand": "CLIF BUILDER'S",
  "stars": 4.2,
  "reviewsCount": 555,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51rPwdVK9QL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars",
  "description": "CLIF BUILDERS OREO-Flavored Protein Bars are designed to help support hardworking bodies after tough workouts, whether you’re at the gym, on the court, or on the track. This protein bar delivers an iconic and delicious mashup: the flavor of milk's favorite chocolate sandwich cookie and CLIF BUILDERS! Packed with 20 grams of protein* per bar to help support, rebuild, and repair muscles, these high protein bars work hard to help build something great. These non-GMO and gluten free protein bars are also low glycemic for a tasty addition to your post-workout recovery regimen. *See nutrition information for saturated fat content.",
  "price": {
    "value": 14.98,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DZXJ7LJG"
},
{
  "title": "Built Bar, Puff Protein Bars, Cookie Dough Chunk Puff, 15g Protein Snacks, On-The-Go Bars, Only 160 Calories, 8g Sugar, Collagen, Not Gluten Free, 12 Count",
  "asin": "B0B7P7QNK3",
  "brand": "Built Bar",
  "stars": 4.4,
  "reviewsCount": 10732,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41t+dql-HlL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 29.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0B7P7QNK3"
},
{
  "title": "Misfits Protein Bar Variety Pack | Nutrition Bars - 14-15g Protein, 1g Sugar, Plant-based, Low Carb, Non-GMO, Gluten Free Snacks | Pack of 12, Multiple Flavors",
  "asin": "B0BZWSR74Z",
  "brand": "Misfits",
  "stars": 4.1,
  "reviewsCount": 2100,
  "thumbnailImage": "https://m.media-amazon.com/images/I/512rgsdm6EL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 29.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0BZWSR74Z"
},
{
  "title": "think! Protein Bars, High Protein Snacks, Gluten Free, Kosher Friendly, Girl Scouts Thin Mint, Nutrition Bars, 2.1 Oz per Bar, 10 Count (Packaging May Vary)",
  "asin": "B0BVMWDBFM",
  "brand": "think!",
  "stars": 4.2,
  "reviewsCount": 15490,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71vlhdLUGUL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Some things shouldn't require a lot of thought, like choosing a delicious, protein-packed snack! Every Girl Scouts Thin MintsTM think! High Protein Bar delivers deeply satisfying taste and texture with 0g of sugar* alongside 20g of protein. Layered with the classic flavor combo of cool mint and rich dark chocolate, you’ll never overthink snack time again! *Not a low calorie food",
  "price": {
    "value": 22.78,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0BVMWDBFM"
},
{
  "title": "Pure Protein Bars, High Protein, Nutritious Snacks to Support Energy, Low Sugar, Gluten Free, Chocolate Deluxe, 1.76 oz., 12 Count(Pack of 1) (Packaging may vary)",
  "asin": "B00MNXGSAI",
  "brand": "Pure Protein",
  "stars": 4.3,
  "reviewsCount": 16060,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51DXXAMcgxL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Indulge in the rich, decadent flavor of Pure Protein Chocolate Deluxe Bars while fueling your active lifestyle. Each bar is packed with 20g of high-quality protein to support muscle recovery, energy, and your fitness goals. Crafted with a luxurious chocolate taste, these gluten-free, low-sugar bars are the perfect snack for satisfying your sweet cravings without derailing your nutrition plan. Whether you’re looking for pre-workout fuel, post-workout recovery, or a convenient on-the-go snack, these bars deliver the taste and nutrition you need. Pure Protein Chocolate Deluxe Bars offer a perfect balance of flavor and function, keeping you energized and on track with your health and wellness journey.",
  "price": {
    "value": 16.94,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00MNXGSAI"
},
{
  "title": "Legendary Foods Cinnamon Roll 22g Protein Bars – Gluten-Free, Low Carb Meal Option – Sweet Zero Sugar Snack, Keto-Friendly – 10-Pack High Protein Pre- or Post-Workout Nutrition Bars",
  "asin": "B0D6RYPXYM",
  "brand": "Legendary Foods",
  "stars": 4,
  "reviewsCount": 6217,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51sgtmzGp2L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 26.05,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0D6RYPXYM"
},
{
  "title": "Quest Nutrition Cookies & Cream Protein Bars, 21g Protein, 1g Sugar, 4g Net Carb, High Fiber, Gluten Free, Keto Friendly, 12 Count",
  "asin": "B00I0DI0Z6",
  "brand": "Quest",
  "stars": 4.3,
  "reviewsCount": 101970,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81of4XL+BBL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Succumb to chunky cookie bits. Quest Cookies & Cream Protein Bars feature chocolatey sandwich cookie pieces and white chocolatey chunks for a delicious taste that reminds you of cookies & cream ice cream. And with 21g of protein, 1g of sugar, and 4g of net carbs per bar* they’re the ultimate cookies & cream cheat code. Satisfy your cravings with the wonderfully sweet & creamy flavor of cookies & cream without ignoring your protein goals. Keep a few in your gym bag, desk drawer, or pantry for whenever you want a tasty protein snack. Be sure to stock up on these cookies & cream protein bars and all your other Quest favorites, from cookies and chips - to shakes, candies, and more. Surrender to satisfaction and set your taste buds free. It’s basically cheating. *Per Serving. See Nutrition Facts for Calories Content. 7 g of Total Fat. Net Carbs = Total Carbs - Fiber - Sugar Alcohols.",
  "price": {
    "value": 23.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00I0DI0Z6"
},
{
  "title": "Pure Protein Bars, High Protein, Nutritious Snacks to Support Energy, Low Sugar, Gluten Free, Chocolate Peanut Butter, 1.76oz, 12 Count (Packaging May Vary)",
  "asin": "B00GJ82VK4",
  "brand": "Pure Protein",
  "stars": 4.4,
  "reviewsCount": 61843,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51j2KOV9-+L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Pure Protein Chocolate Peanut Butter Protein Bars are delicious high protein snacks with high quality protein that support lean muscle and strength. These peanut butter chocolate protein bars contain whey protein isolate and are gluten free. Each protein bar contains 20 grams of protein, 200 calories and 2 grams of sugar to support your busy and active lifestyle. Grab a Pure Protein bar for high quality protein, an essential part of a nutritious, balanced diet. With classic chocolate peanut butter flavor, these high protein bars are a treat any time of day. Whether you prefer to enjoy peanut butter protein bars pre workout, post workout, or on the go, you’ll love the peanut butter taste in these gluten free protein bars. Pure Protein is proud to offer high protein snack bars with low sugar and great taste.",
  "price": {
    "value": 16.94,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00GJ82VK4"
},
{
  "title": "FITCRUNCH Snack Size Protein Bars, 6-Layer Baked Bar, 3g of Sugar, Gluten Free & Soft Cake Core (9 Bars, Peanut Butter Crunch)",
  "asin": "B0FFHG7SBG",
  "brand": "Fit Crunch",
  "stars": 4.3,
  "reviewsCount": 12215,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51LRNrtxFLL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Chef Robert Irvine’s FITCRUNCH makes getting your protein more enjoyable than ever before. Satisfy your cravings with a variety of delicious products from world-renowned chef and FITCRUNCH owner Robert Irvine.",
  "price": {
    "value": 21.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0FFHG7SBG"
},
{
  "title": "GoMacro MacroBar Organic Vegan Protein Bars - Maple Sea Salt",
  "asin": "B07T7S1MDB",
  "brand": "GoMacro",
  "stars": 4.5,
  "reviewsCount": 2272,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41YBwt83KgL._SX300_SY300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Enjoy a moment of Pure Promise with our Maple Sea Salt MacroBar. The warmth of organic maple syrup is perfectly balanced with a dash of real sea salt, while a handful of pumpkin seeds adds a delicious flavor to this nut-free bar.",
  "price": {
    "value": 50.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07T7S1MDB"
},
{
  "title": "Quest Nutrition Ultimate Variety Pack Protein Bars, High Protein, Low Carb, Gluten Free, Keto Friendly, 12 Count",
  "asin": "B07J2MM23Z",
  "brand": "Quest",
  "stars": 4.3,
  "reviewsCount": 101970,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81iRYgvvE6L._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Quest Ultimate Protein Bars Variety Pack brings together the big taste of athlete-worthy nutrition in the original Quest Protein Bars you love. No need to pick your favorite when each bar has the protein and delicious taste you want, without pilling on the sugar and net carbs you don’t. Featuring the great flavors of Blueberry Muffin, Chocolate Brownie, Chocolate Chip Cookie Dough (x2), Chocolate Peanut Butter, Cookies & Cream (x2), Double Chocolate Chunk, Mint Chocolate Chunk, Oatmeal Chocolate Chip, S'mores, and White Chocolate Raspberry. The Ultimate Protein Bars Variety Pack contains 20-21g of protein, 4-5g of net carbs, and 0-2g of sugar per serving*.",
  "price": {
    "value": 26.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07J2MM23Z"
},
{
  "title": "Nature Valley Breakfast Bars, Protein Granola Bars, Peanut Butter Dark Chocolate, Chewy, Gluten-Free, Individually Wrapped, On-the-Go, No Artificial Flavors or High Fructose Corn Syrup, 15-Count Box",
  "asin": "B06XJTCM38",
  "brand": "Nature Valley",
  "stars": 4.6,
  "reviewsCount": 23559,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51N5XZ0o5+L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > Granola",
  "description": "Nature Valley Chewy Protein Granola Bars, Peanut Butter Dark Chocolate, provide a good source of protein (10g) per serving in a gluten-free, chewy granola bar format. Each bar features a delicious blend of dark chocolate chips, roasted peanuts, and creamy peanut butter, making these granola bars a satisfying snack for any time of day. This 21.3 oz box contains 15 bars, providing granola bars bulk convenience for families, offices, or anyone seeking a practical snack solution. These protein bars are made with no artificial flavors, no artificial colors, and no high fructose corn syrup, supporting your search for protein snacks, good source of protein snacks, and gluten free snacks. Nature Valley granola bars are ideal for snack time, on-the-go, lunch box, pantry, or hiking trail, and can be enjoyed as protein snacks or snack bars. The Peanut Butter Dark Chocolate flavor appeals to a wide range of tastes, making these bars suitable as protein snacks for adults and snacks for kids. With a focus on quality ingredients and a trusted brand, these chewy granola bars offer a reliable source of protein for busy mornings, outdoor adventures, or anytime you need a quick, wholesome snack. Produced by General Mills Sales Inc., this bulk pack of granola bars is a smart choice for those looking for value, taste, and nutrition in one convenient box. Whether you’re stocking up for the family, preparing for a road trip, or looking for a protein snack bar to keep in your pantry, Nature Valley Chewy Protein Granola Bars provide the protein, flavor, and convenience you need. Enjoy the combination of protein bars and granola bars in every bite, and experience the benefits of a good source of protein, gluten-free snack that fits your active lifestyle.",
  "price": {
    "value": 7.79,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B06XJTCM38"
},
{
  "title": "think! Protein Bars, High Protein Snacks, Gluten Free, Sugar Free Energy Bar with Whey Protein Isolate, Brownie Crunch, Nutrition Bars without Artificial Sweeteners, 2.1 Oz (12 Count)",
  "asin": "B0B17P5N3D",
  "brand": "think!",
  "stars": 4.2,
  "reviewsCount": 15490,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71DTUvZy38L._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "Some things shouldn't require a lot of thought, like choosing a delicious, protein-packed snack! Every Brownie Crunch think! High Protein Bar delivers deeply satisfying taste and texture with 0g of sugar* alongside 20g of protein. Full of the delightfully decadent flavors of chocolate, brownies, and almonds, you’ll never overthink snack time again! *Not a low calorie food",
  "price": {
    "value": 16.97,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0B17P5N3D"
},
{
  "title": "Rise Whey Protein Bars - Honey Cinnamon | Breakfast Bar & Protein Snack 18g Protein 4g Fiber Just 5 Whole Food Ingredients Gluten-Free Soy Free",
  "asin": "B014R5T8TW",
  "brand": "Rise",
  "stars": 4,
  "reviewsCount": 3776,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41qxC2qWVaL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 21.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B014R5T8TW"
},
{
  "title": "CLIF BAR - Energy Protein Bars - Crunchy Peanut Butter - Made with Organic Oats - Energy Bars - Non-GMO - (15 Pack)",
  "asin": "B0CXQ6QP2B",
  "brand": "CLIF Bar",
  "stars": 4.7,
  "reviewsCount": 4288,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51-NCPoqliL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Endurance & Energy Bars",
  "description": "Born on a 175-mile bike ride, CLIF BAR energy bars are purposefully crafted with a mix of protein, fat, and carbohydrates to help sustain active bodies before and during long-lasting activity. CLIF BAR energy bars are made with quality ingredients like wholesome organic rolled oats and no high-fructose corn syrup, and they are non-GMO and plant-based for a granola bar you can feel good about. As part of the CLIF brand mission, our 2 LEED certified bakeries and Emeryville, CA office run with the help of on-site solar arrays and/or offset electricity through the purchase of renewable energy credits (RECs). From CLIF BAR Energy Bars to Builders Protein Bars and Zbar Snack Bars, our brands turn grabbing a bar into raising your bar.",
  "price": {
    "value": 14.67,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CXQ6QP2B"
},
{
  "title": "think! Protein Bars, High Protein Snacks, Gluten Free, Kosher Friendly,Variety Pack, Nutrition Bars, 2.1 Oz per Bar, 12 Count (Packaging May Vary)",
  "asin": "B07Y35ZWG8",
  "brand": "think!",
  "stars": 4.2,
  "reviewsCount": 15490,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81+gMdGlgzL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": "The think! Best Seller Variety Pack includes two of our popular indulgent flavors: White Chocolate and Berries & Creme.",
  "price": {
    "value": 16.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07Y35ZWG8"
},
{
  "title": "Pure Protein Bars Chocolate Variety Pack (18 ct)",
  "asin": "B01126O3OY",
  "brand": "Pure Protein",
  "stars": 4.5,
  "reviewsCount": 34028,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51KaMAhj7JL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Satisfy your cravings and fuel your day with the Pure Protein Bar Variety Pack. This pack includes 18 delicious, high-protein bars. Perfectly crafted to support your active lifestyle, these bars are gluten-free and enriched with collagen, delivering 20 grams of protein per serving to help build and maintain muscle. With low sugar content, these bars are a guilt-free option for your pre- or post-workout snack, midday boost, or on-the-go meal replacement. Each bar combines indulgent flavors with powerful nutrition, making them a must-have for athletes, fitness enthusiasts, and busy individuals alike.",
  "price": {
    "value": 21.58,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B01126O3OY"
},
{
  "title": "Built Bar, Puff Protein Bars, Salted Caramel Puff, 17g Protein Snacks, On-The-Go Bars, Only 140 Calories, 6g Sugar, Collagen, Gluten Free, 12 Count",
  "asin": "B0DGMFL2TV",
  "brand": "Built Bar",
  "stars": 4.4,
  "reviewsCount": 10732,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41LKwvzA3dL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 29.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DGMFL2TV"
},
{
  "title": "Lenny & Larry's Cookie-fied Bar – Chocolate Chip Cookie Dough Vegan Protein Bars 9x45g – Healthy Snacks with 12g Plant Protein & 5g Fiber – Gluten free Power Bar, Keto Friendly, Non-GMO & Vegan",
  "asin": "B0DMWTXKVZ",
  "brand": "Lenny & Larry's",
  "stars": 4.3,
  "reviewsCount": 5661,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51Ehog7JRWL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": null,
  "price": {
    "value": 13.77,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DMWTXKVZ"
},
{
  "title": "Barebells Protein Bars White Chocolate Almond - 12 Count, 20g High Protein Treats - Chocolate Nutrition Bar with 1g Total Sugars - On-The-Go Breakfast or Post-Workout Snack",
  "asin": "B08171M7GN",
  "brand": "BAREBELLS",
  "stars": 4.4,
  "reviewsCount": 18459,
  "thumbnailImage": "https://m.media-amazon.com/images/I/4136LjCNB+L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 29.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B08171M7GN"
},
{
  "title": "CLIF BUILDERS Protein Bars - Cookies 'n Cream Flavor - 20g Plant Based Protein - Gluten Free - Non-GMO - Low Glycemic - No Artificial Sweeteners - 2.4 oz. (12 Pack)",
  "asin": "B000668QZ4",
  "brand": "CLIF BUILDER'S",
  "stars": 4.3,
  "reviewsCount": 1253,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51c4ozpKH2L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "CLIF BUILDERS plant based protein bars are designed to fuel hardworking bodies before or after tough workouts, whether you’re at the gym, on the court, or on the track. These high protein bars are packed with 20g of complete plant protein*, including essential amino acids to help support, rebuild, and repair muscles, our gluten free protein bars work as hard as you do to build something great. These plant protein bars are also non-GMO, gluten free, and low glycemic with no high-fructose corn syrup or artificial flavors for a powerful (and tasty) addition to your pre-workout and post-workout recovery regimen. *See nutrition for saturated fat content.",
  "price": {
    "value": 15.28,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B000668QZ4"
},
{
  "title": "Power Crunch Protein Wafer Bars, High Protein Snacks with Delicious Taste, Peanut Butter Fudge, 1.4 Ounce (12 Count)",
  "asin": "B000FRXJ6A",
  "brand": "Power Crunch",
  "stars": 4.6,
  "reviewsCount": 12210,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51RG-plLtuL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Power Crunch Bars are the perfect protein snacks for home or on the go. With 12-14 grams of protein and only 5-8 grams of sugar, these delicious-tasting whey protein energy bars are the ideal snacks. Power Crunch makes the perfect High Protein Snacks with high-DH hydrolyzed Proto Whey Protein. Easier to digest protein makes Power Crunch the pinnacle of smart protein nutrition! Our wafer cookie and delicious flavor assortment will make you forget you’re eating a high-protein bar.",
  "price": {
    "value": 16.01,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B000FRXJ6A"
},
{
  "title": "IQBAR Brain and Body Plant Protein Bars - Chocolate Sea Salt - 12-Count - Keto, Vegan, Low Carb, High Fiber, Gluten Free, Dairy Free, Low Sugar Snack with Nutrients for Focus, Energy, Meal Replacement",
  "asin": "B0876LNH8Y",
  "brand": "IQBAR",
  "stars": 4.2,
  "reviewsCount": 27725,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51ocPhQHYUL._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Grocery & Gourmet Food > Snacks & Sweets > Snack Foods > Bars > High Protein",
  "description": null,
  "price": {
    "value": 24.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0876LNH8Y"
},
{
  "title": "TRUBAR Vegan Protein Bar, Strawberry Shorty Got Cake, Gluten Free, Plant Based Protein, Dairy Free, Non GMO, Soy Free, No Sugar Alcohols, 12G Protein, 12G Fiber, 23G Carb, On the Go Snack Bars, 12 CT",
  "asin": "B0DT4THSRS",
  "brand": "TRUBAR",
  "stars": 4.2,
  "reviewsCount": 3743,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41ZDrPf6z4L._SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": null,
  "price": {
    "value": 21,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DT4THSRS"
},
{
  "title": "think!, High Protein Bars - Cookies and Crème, 20g Protein, 0g Sugar, No Artificial Sweeteners, Gluten Free, GMO Free, 2.1 Ounce bar",
  "asin": "B077G2YFMJ",
  "brand": "think!",
  "stars": 4.3,
  "reviewsCount": 1465,
  "thumbnailImage": "https://m.media-amazon.com/images/I/7156SNn8+oL._AC_SX300_SY300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Diet & Sports Nutrition > Nutrition Bars & Drinks > Nutrition Bars > Protein Bars",
  "description": "Cookies and Cream is a delicious blend of creamy milk flavor and chocolaty cookie bite",
  "price": null,
  "url": "https://www.amazon.com/dp/B077G2YFMJ"
}]