[{
  "title": "365 by Whole Foods Market, Paper Towels 75 Sheet jumbo Rolls 6 Count, 75 Count",
  "asin": "B07QMW9YJV",
  "brand": "365 by Whole Foods Market",
  "stars": 4.3,
  "reviewsCount": 6519,
  "thumbnailImage": "https://m.media-amazon.com/images/I/51aJBpgT08L._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Many paper towels are bleached with chlorine, including some brands made with recycled paper. When paper is bleached with chlorine, dangerous chemicals can be released into the environment. Our paper towels are whitened using a safer, environmentally progressive whitening process.",
  "price": null,
  "url": "https://www.amazon.com/dp/B07QMW9YJV"
},
{
  "title": "Amazon Brand - Presto! Flex-a-Size Paper Towels, 158 Sheet Huge Roll, 12 Rolls (2 Packs of 6), Equivalent to 38 Regular Rolls, White",
  "asin": "B074CR89QG",
  "brand": "Presto!",
  "stars": 4.5,
  "reviewsCount": 114430,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71YEIXHoTQL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Industrial & Scientific > Janitorial & Sanitation Supplies > Paper Products > Paper Towels",
  "description": "Includes 12 Huge Rolls (2 Packs of 6 Huge Rolls) of 158 2-ply sheets per roll, 12 Huge Rolls = 38 Regular Rolls (based on a regular roll with 49 sheets)",
  "price": {
    "value": 22.72,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B074CR89QG"
},
{
  "title": "Bounty Full Sheet Paper Towels, White, 2 Triple Rolls = 6 Regular Rolls (Packaging May Vary)",
  "asin": "B0DQYPKQ8P",
  "brand": "Bounty",
  "stars": 4.8,
  "reviewsCount": 2738,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81D0v+mVAhL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty Paper Towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a Durable Diamond Texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often* to always have Bounty on hand. Buy in bulk! Choose from different sheet sizes based on what works best for your needs, including Select-A-Size and Full-Size. You can also change it up with our printed designs. *vs Bounty Regular Roll",
  "price": {
    "value": 9.69,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DQYPKQ8P"
},
{
  "title": "Tork Multifold Hand Towel White H2, Universal, 100% Recycled Fibers, 16 x 250 Towels, MB540A",
  "asin": "B00M6XTBJK",
  "brand": "Tork",
  "stars": 4.2,
  "reviewsCount": 3116,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41H8LJh9tAL._SX342_SY445_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Product DescriptionTork Universal Hand Towels The white paper hand towels in Universal quality meet basic requirements in the washroom. Products in the Universal line are designed for businesses seeking to achieve a more impactful, eco-friendly facility by choosing to use products which are produced with methods much less harmful to the environment. These cost-effective towels are suitable for healthcare, manufacturing, industrial and educational facilities.Tork Universal Multifold Hand Towel: + Easily dispensed to promote traffic flow with \"no-touch\" service + Ideal for low to medium traffic washrooms.From the ManufacturerTork Universal Multifold Hand Towels provide the right combination of quality, performance and value. Embossing enhances hand feel and maximum performance. Multifold design provides for less towel consumption leading to source reduction, storage space savings, and lower overall costs. High wet strength provides a premium quality people appreciate. Fast absorbency helps to control usage, so you save on reduced waste and maintenance time. \"No touch\" hand towel service offers sanitary conditions. Towels are made from 100% recycled fibers providing environmental benefits, and a positive image builder. Replaces MB530. ECOLOGO Certified. Compostable Verified by Independent Verification.",
  "price": {
    "value": 35.06,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00M6XTBJK"
},
{
  "title": "Bounty Quick Size Paper Towels, White, 8 Family Rolls = 20 Regular Rolls (Packaging May Vary)",
  "asin": "B07MHJFRBJ",
  "brand": "Bounty",
  "stars": 4.8,
  "reviewsCount": 290994,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81VMM23IRBL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty Quick Size Paper towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a Durable Diamond Texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often vs Bounty Regular Rolls to always have Bounty on hand. Buy in bulk! Bounty Quick Size towels have easy tear sheets, so you can select your sheet size based on the size of your mess.",
  "price": {
    "value": 24.42,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07MHJFRBJ"
},
{
  "title": "Viva Multi-Surface Cloth Paper Towels, Task Size - 12 Super Rolls (2 Packs of 6) - 81 Sheets Per Roll",
  "asin": "B09Y8RYLC4",
  "brand": "Viva",
  "stars": 4.6,
  "reviewsCount": 10549,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81ff-AgaMmL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Viva Multi-Surface Cloth Paper Towels feature a unique texture to lift and trap mess on kitchen countertops, bathroom surfaces and and more. Our cloth paper towels help you clean with 4x Cleaning Power: remove dirt, scrub grime, absorb quickly, and lock liquid. And you have plenty of paper towels to take care of messes: you get 2 packs of 6 rolls with 12 rolls total, 81 sheets per roll and perforations that let you choose the sheet size for your task. Each of these cloth paper towels traps mess 3x better when wet vs. our dry towel. Viva Multi-Surface Cloth also helps you clean because it's more absorbent* for multiple tasks. Plus our versatile cloth paper towels each have 2 absorbent layers to soak up mess and clean metal, granite, glass, and wood. Get a clean you can count on thanks to a unique texture to trap and toss mess. Viva towels are made with the environment in mind: Viva towels are sustainably sourced from responsibly managed forests. *vs. leading value brand",
  "price": {
    "value": 19.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09Y8RYLC4"
},
{
  "title": "Kleenex Disposable Paper Hand Towels, 6 Boxes, 60 Tissues per Box (360 Total Tissues), Packaging May Vary",
  "asin": "B00BFUSDO4",
  "brand": "Kleenex",
  "stars": 4.8,
  "reviewsCount": 26052,
  "thumbnailImage": "https://m.media-amazon.com/images/I/61L7mI1QoYL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Scratchy paper towels? No thank you. Keep your hands (luxuriously) clean with Kleenex Disposable Paper Hand Towels instead. Whether you’re looking for an easy upgrade to your bathroom routine or prepping your house for guests, with Kleenex Disposable Paper Hand Towels, you get 60 towels in every box, so you have plenty of disposable towels for everyone. Free of inks, dyes and fragrances, Kleenex Disposable Paper Hand Towels are a cleaner way to dry hands* and feature a cloth-like feel. Plus, you can find a paper towel box that fits your home because each hand towel box is available in various colors and designs. Got the sniffles? Soothe that runny nose with a box of Kleenex Soothing Lotion or Kleenex Ultra Soft facial tissues.*vs. cloth towels",
  "price": {
    "value": 19.19,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B00BFUSDO4"
},
{
  "title": "Bounty Paper Towels Quick Size, White, 16 Family Rolls = 40 Regular Rolls",
  "asin": "B079VP6DH5",
  "brand": "Bounty",
  "stars": 4.8,
  "reviewsCount": 290994,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81JieznBIhL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Spilled your drink? Quick! The Quicker Picker Upper. Be ready to tackle messes and spills with Bounty Paper Towels! Each sheet is 2x more absorbent, so you can use less and pick up spills and messes quicker than the leading ordinary brand. That’s why Bounty is the Quicker Picker Upper! Bounty Paper Towels are available in two sheet sizes, Full Sheet and Quick Size, so you can choose which option works best for you. Bounty Quick Size towels are versatile, so you can choose your sheet size depending on your mess. And if you’re buying the bigger packs, you’ll always have Bounty on hand. Bounty has a variety of pack and roll sizes to fit your needs. Bounty products are proudly made with American jobs and we’re fully committed to creating solutions for a sustainable future. Across all our products, we consider the impact on people, forests, and the world. That’s why for every tree we use, at least two are regrown so you can conveniently and confidently clean messes in the kitchen and around the house knowing Bounty Paper Towels is helping to keep forests greener. Bounty always has your back in and out of the kitchen so whether it’s juice on the counter or ice cream on the table, we make sure spills won’t stand a chance. *vs. leading ordinary brand",
  "price": {
    "value": 43.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B079VP6DH5"
},
{
  "title": "Tork Hand Towel Roll, Natural, Universal, H71, Large, 100% Recycled, 1-Ply, White, 6 Rolls x 800 ft, 7171300",
  "asin": "B07DPVPZZ7",
  "brand": "Tork",
  "stars": 4.5,
  "reviewsCount": 100,
  "thumbnailImage": "https://m.media-amazon.com/images/I/41U88qoO1IL._SX342_SY445_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Tork Universal Hand TowelsThe natural paper hand towels in Universal quality meet basic requirements in the washroom. Products in the Universal line are designed for businesses seeking to provide their washroom with economic, cost-efficient solutions, in good quality, which still maintains a professional appearance. These general towels are suitable for healthcare, manufacturing, industrial and educational facilities.Tork Universal Hand Towel Roll:+ Large roll size - ideal combo of quality, performance, and value+ Embossing enhances hand feel and maximum absorbency+ Made from 100% recycled fiber+ Minimum of 50% post-consumer fibers",
  "price": {
    "value": 48.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07DPVPZZ7"
},
{
  "title": "Amazon Basics 2-Ply Flex-Sheets Paper Towels, 12 Basics Rolls = 40 Regular Rolls, Everyday Value with 150 Sheets per Roll, Packaging May Vary",
  "asin": "B09BWFX1L6",
  "brand": "Amazon Basics",
  "stars": 4.2,
  "reviewsCount": 63350,
  "thumbnailImage": "https://m.media-amazon.com/images/I/61POocZniqL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Introducing the Amazon Basics 2 Ply Paper Towel with Flex-Sheets, your reliable companion for tackling everyday spills and messes with ease. Each pack includes 12 value rolls, ensuring you have an ample supply for all your cleaning needs. Ideal for effortlessly cleaning hard surfaces such as mirrors, glass, and countertops. Whether you're dealing with kitchen spills, bathroom messes, or general household cleaning tasks, these paper towels are up to the challenge. Their durable construction and absorbent nature ensure efficient cleaning, saving you time and effort. Stock up on Amazon Basics Paper Towels today and experience the convenience and reliability that makes cleaning a breeze. Amazon Basics are the quality products you count on for all your everyday moments.",
  "price": {
    "value": 22.86,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09BWFX1L6"
},
{
  "title": "Viva Signature Cloth Paper Towels, 3 Double Rolls, 86 Sheets per Roll",
  "asin": "B0DF9BGP8S",
  "brand": "Viva",
  "stars": 4.8,
  "reviewsCount": 2881,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81qs4FmwWeL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Give yourself a paper towel that works as hard as you do with Viva Signature Cloth Paper Towels. This pack of Viva paper towels includes 3 double rolls with 86 sheets per roll and features Viva’s Choose-A-Sheet size that lets you choose the right sheet size for your task. As the softest and most durable towel*, our paper towels deliver an exceptional, thorough clean. They’re also the most cloth-like towels, making them great for hands and faces! Not only are they soft, but these paper towels are also strong like cloth and are 2x more durable**, making them perfect for scrubbing tough, dried-on messes. Plus, you can rinse and reuse each sheet for multiple cleaning needs. (*among premium branded towels. Durable when wet) (**when wet vs. the leading 1-ply value brand)",
  "price": {
    "value": 7.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DF9BGP8S"
},
{
  "title": "Bounty Paper Towels Select-A-Size White, 6 Double Rolls, 82 Sheets Per Roll",
  "asin": "B0DQLQGL9P",
  "brand": "Bounty",
  "stars": 4.7,
  "reviewsCount": 169,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81yGWD+YdGL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty Paper Towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a Durable Diamond Texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often* to always have Bounty on hand. Buy in bulk! Choose from different sheet sizes based on what works best for your needs, including Select-A-Size and Full-Size. You can also change it up with our printed designs. *vs Bounty Regular Roll",
  "price": null,
  "url": "https://www.amazon.com/dp/B0DQLQGL9P"
},
{
  "title": "Bounty Quick-Size Paper Towels, White, 12 Family Triple Rolls = 40 Regular Rolls",
  "asin": "B0DQYQKZQ2",
  "brand": "Bounty",
  "stars": 4.8,
  "reviewsCount": 290994,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81jCqCxTbjL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty Quick Size Paper towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a Durable Diamond Texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often vs Bounty Regular Rolls to always have Bounty on hand. Buy in bulk! Bounty Quick Size towels have easy tear sheets, so you can select your sheet size based on the size of your mess.",
  "price": {
    "value": 42.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DQYQKZQ2"
},
{
  "title": "Sparkle Pick-A-Size Paper Towels, 24 Double Rolls (2,640 Sheets Total) - Strong 2-Ply Towels for Kitchen Cleanup and Everyday Messes",
  "asin": "B09R4WJ2HG",
  "brand": "SPARKLE",
  "stars": 4.6,
  "reviewsCount": 82061,
  "thumbnailImage": "https://m.media-amazon.com/images/I/813Ziwk5UhL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Sparkle® Pick-A-Size® Paper Towels are strong for everyday messes! So go ahead, reach for a full or half sheet to handle life's everyday twists and turns-from unavoidable messes and spills to last-minute art projects and all the routine cleanups in between. With Sparkle® Kitchen Paper Towels on hand, you'll be prepared for whatever comes your way at an affordable price to boot! Sparkle® Pick-A-Size® Paper Towels with Thirst Pockets® are designed with a perforation in each sheet so you can choose between a full size or half size sheet for your everyday tasks. Each Double Roll contains 110 2 ply paper towel sheets. Sparkle® Paper Towels are just right for cleaning up your everyday messes without cleaning out your piggy bank. Whether you need to wipe up a mess in your kitchen, take care of small spills, shine up your windows and mirrors or wipe your hands or face clean, Sparkle® Pick-A-Size® Paper Towels allow you to spend less on your everyday messes.",
  "price": {
    "value": 31.68,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09R4WJ2HG"
},
{
  "title": "Amazon Basics 2-Ply Flex-Sheets Paper Towels, 2 Basics Rolls = 6 Regular Rolls, Everyday Value with 150 Sheets per Roll, Packaging May Vary",
  "asin": "B0CGW6XZGT",
  "brand": "Amazon Basics",
  "stars": 4.2,
  "reviewsCount": 63350,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71tXcUdNE+L._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Introducing the Amazon Basics 2 Ply Paper Towel with Flex-Sheets (2 Rolls), your reliable companion for tackling everyday spills and messes with ease. Ideal for effortlessly cleaning hard surfaces such as mirrors, glass, and countertops. Whether you're dealing with kitchen spills, bathroom messes, or general household cleaning tasks, these paper towels are up to the challenge. Their durable construction and absorbent nature ensure efficient cleaning, saving you time and effort. Stock up on Amazon Basics Paper Towels today and experience the convenience and reliability that makes cleaning a breeze. Amazon Basics are the quality products you count on for all your everyday moments.",
  "price": {
    "value": 4.04,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CGW6XZGT"
},
{
  "title": "Scott Paper Towels, Choose-A-Sheet, 6 Double Rolls = 12 Regular Rolls (108 Sheets Per Roll)",
  "asin": "B0DF8RSVJK",
  "brand": "Scott",
  "stars": 4.5,
  "reviewsCount": 13573,
  "thumbnailImage": "https://m.media-amazon.com/images/I/8105RJnfNEL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Now MORE Sheets on our Scott Choose-A-Sheet paper Towel Roll! For a quick clean at an incredible price, each paper towel roll comes with 108 sheets per roll and features Scott’s Choose-A-Sheet size that lets you choose the right sheet size for your task. And get more sheets per dollar* with Scott Choose-A-Sheet Paper Towel Rolls. Scott Paper Towels are more absorbent than the leading brand for your money** to help you tackle everyday messes at the right value. Our paper towels are a trusted combination of value and strength, so you can use them anytime, anywhere, no matter the mess. These disposable paper towels are virtually lint-free when you wipe to help you leave any surface spotless. Scott brand paper towels are FSC-certified and have 100% paper fibers sourced from responsibly managed forests. Buy Scott Paper Towels in bulk and save yourself trips to the store or extra deliveries. (*vs. the leading brand regular roll select-a-size) (**Fluid absorbed per dollar, based on average retail price at a combination of grocery, drug, dollar, and mass outlets for 52 week ending 12/30/23)",
  "price": {
    "value": 6.84,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DF8RSVJK"
},
{
  "title": "Georgia-Pacific Pacific Blue Select 2-Ply Perforated Roll Paper Towel (Previously Branded Preference), White, 27700, 250 Sheets Per Roll, 12 Rolls Per Case",
  "asin": "B0040ZFRSQ",
  "brand": "Georgia-Pacific",
  "stars": 4.4,
  "reviewsCount": 8540,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71SS4ou-TuL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Universal Paper Roll Towels are an essential supply, and often the most economical way, for away-from-home facilities to meet their hand-drying and light cleaning needs. Universal roll towels come in white and brown colors, with recycled content options available, and varying lengths to meet the capacity needs of various businesses and work areas. They are essentially a single, long piece of towel wound tightly to get the maximum length on a single roll and are often referred to as “hardwound roll towels.” Because the towel sheet is not perforated, or ‘perfed’, universal roll towels are dispensed from a dispenser that has a cutting blade built inside so the worker can tear off the amount of towel they need for the job at hand. These towels fit a range of ‘universal roll towel’ dispensers that are mounted on the wall and are often provided by towel manufacturers. The systems range from roll lengths of 350’, 800’ and 1,000’ for areas that experience high volume and surges of activity like a shift-change in a manufacturing facility or changing of classes at a large school. GP PRO is a division of Georgia-Pacific Consumer Products. We deliver well-designed, durable and easy-to-maintain professional solutions to meet the handwashing and cleaning needs for a range of business applications.",
  "price": {
    "value": 44.4,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0040ZFRSQ"
},
{
  "title": "Scott Professional Universal Multifold Paper Towels, Bulk (01804), Absorbency Pockets, White, 9.2\"x9.4\" Towel, Compressed (250 Sheets/Pack, 16 Packs/Case, 4,000 Sheet Total)",
  "asin": "B001AZKS4W",
  "brand": "Scott Professional",
  "stars": 4.6,
  "reviewsCount": 11855,
  "thumbnailImage": "https://m.media-amazon.com/images/I/416SViJCpfL._SX342_SY445_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Scott provides reliable balance of efficiency, performance and value. Whether you need commercial paper towels for your office kitchen or restroom, Scott Multifold Paper Towels are an excellent—and economical—choice. These commercial paper towels feature Absorbency Pockets that absorb a lot of water fast, for superior hand drying. They're designed to reduce waste in your office or business, since they fit into any universal dispenser for tri-fold paper towels or multifold towels (which helps control over use).This product meets or exceeds EPA guidelines for minimum post-consumer waste content, is ECOLOGO and FSC certified; FSC mix paper supporting responsible forestry. This product is a part of The Responsible Partners program by Kimberly-Clark Professional, which is designed to reach our sustainability goals. The Responsible Partners program identifies products in our portfolio that: Lighten our collective footprint, Enhance product efficiencies, Transport in an environmentally responsible way, and Reduce greenhouse gas emissions (GHG).",
  "price": {
    "value": 35.7,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B001AZKS4W"
},
{
  "title": "Genuine Joe Multifold Hand Towels, 9.5\" x 9.10\", 1-Ply, White, 250/Pack, 16 Count",
  "asin": "B000JCPU54",
  "brand": "Genuine Joe",
  "stars": 4.5,
  "reviewsCount": 7985,
  "thumbnailImage": "https://m.media-amazon.com/images/I/91R-FFa6sPL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Multifold towels facilitate hands-free dispensing. Interfolded towels encourage faster traffic and cleaner restrooms. Deeply embossed design offers thickness and preferable feel. Ideal for public environments. Each bundle includes 250 towels. One-ply towels are made from a high percentage of recycled fiber with post-consumer material.",
  "price": {
    "value": 29.6,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B000JCPU54"
},
{
  "title": "Caboo Tree Free Paper Towels, 8 Rolls, Earth Friendly Sustainable Kitchen Paper Towels with Strong 2 Ply",
  "asin": "B091DBLC61",
  "brand": "Caboo",
  "stars": 4.2,
  "reviewsCount": 5410,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71MowAO6FFL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": null,
  "price": {
    "value": 34.99,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B091DBLC61"
},
{
  "title": "Sparkle Pick-A-Size Paper Towels, 6 Double Rolls (660 Sheets Total) - Strong 2-Ply Towels for Kitchen Cleanup and Everyday Messes",
  "asin": "B09NW92T8Q",
  "brand": "SPARKLE",
  "stars": 4.6,
  "reviewsCount": 82061,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81tfqjSPKtL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Sparkle® Pick-A-Size® Paper Towels are strong for everyday messes! So go ahead, reach for a full or half sheet to handle life's everyday twists and turns-from unavoidable messes and spills to last-minute art projects and all the routine cleanups in between. With Sparkle® Kitchen Paper Towels on hand, you'll be prepared for whatever comes your way at an affordable price to boot! Sparkle® Pick-A-Size® Paper Towels with Thirst Pockets® are designed with a perforation in each sheet so you can choose between a full size or half size sheet for your everyday tasks. Each Double Roll contains 110 2 ply paper towel sheets. Sparkle® Paper Towels are just right for cleaning up your everyday messes without cleaning out your piggy bank. Whether you need to wipe up a mess in your kitchen, take care of small spills, shine up your windows and mirrors or wipe your hands or face clean, Sparkle® Pick-A-Size® Paper Towels allow you to spend less on your everyday messes.",
  "price": {
    "value": 7.92,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B09NW92T8Q"
},
{
  "title": "Bounty Select-A-Size Paper Towels, White, 2 Triple Rolls = 6 Regular Rolls",
  "asin": "B0DQYR6X8R",
  "brand": "Bounty",
  "stars": 4.8,
  "reviewsCount": 10797,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81h-I5d7+LL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty paper towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a durable diamond texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often* to always have bounty on hand. Buy in bulk choose from different sheet sizes based on what works best for your needs, including select-a-size and full-size. You can also change it up with our printed designs. *vs bounty regular roll.",
  "price": {
    "value": 6.97,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DQYR6X8R"
},
{
  "title": "Prefect Stix White MultiFold Paper Towels- Pack of 2-250ct. Total 500 Towels",
  "asin": "B0879L3KM3",
  "brand": "Perfect Stix",
  "stars": 4.3,
  "reviewsCount": 4252,
  "thumbnailImage": "https://m.media-amazon.com/images/I/5194oWcLCDL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "White MultiFold Paper Towels. Pack of 2. 2 packs of 250 count Paper Towels. Total 500 sheets",
  "price": {
    "value": 8.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0879L3KM3"
},
{
  "title": "Bounty Paper Towels Select-A-Size, White, 8 Triple Rolls = 24 Regular Rolls",
  "asin": "B0DQLPD2HM",
  "brand": "Bounty",
  "stars": 4.9,
  "reviewsCount": 118,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71E6MHQeFUL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Bounty Paper Towels are 2x more absorbent, so you can clean up messes quicker and use less than the leading ordinary brand. Each sheet has a Durable Diamond Texture to tackle anything from everyday spills to tough projects throughout your home. A variety of pack and rolls sizes are available, and going bigger means you change the roll less often* to always have Bounty on hand. Buy in bulk! Choose from different sheet sizes based on what works best for your needs, including Select-A-Size and Full-Size. You can also change it up with our printed designs. *vs Bounty Regular Roll",
  "price": null,
  "url": "https://www.amazon.com/dp/B0DQLPD2HM"
},
{
  "title": "Amazon Aware 100% Bamboo Paper Towels, 6 Rolls, 2 ply, FSC Certified, 150 Sheets, 900 Count, Plastic-Free, Multicolor",
  "asin": "B0BMQDG363",
  "brand": "Amazon Aware",
  "stars": 4.2,
  "reviewsCount": 1240,
  "thumbnailImage": "https://m.media-amazon.com/images/I/61BPzeD1euL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": null,
  "price": {
    "value": 19.88,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0BMQDG363"
},
{
  "title": "Viva Multi-Surface Cloth Paper Towels, 3 Double Rolls, 110 Sheets Per Roll",
  "asin": "B0CKWMSSC7",
  "brand": "Viva",
  "stars": 4.6,
  "reviewsCount": 1281,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81z6K7ZqqZL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Take care of messes in your kitchen, bathroom, and every room in-between with Viva Multi-Surface Cloth Paper Towels. This pack of Viva paper towels includes 3 double rolls with 110 sheets per roll and features Viva’s Choose-A-Sheet size that lets you choose the right sheet size for your task. Viva Multi-Surface Cloth Paper Towels deliver 4x the cleaning power that removes dirt, scrubs grime, absorbs quickly, and locks liquid for an exceptional, everyday clean. Not only that, but our cloth paper towels trap mess 3x better* and are more absorbent** for a complete clean. Each sheet is made with two layers for sponge-like absorbency and micro-scrubbing technology, which creates a unique texture that lifts and traps mess to deliver an absorbent clean for all surfaces. No matter the task, Viva Multi-Surface Cloth helps leave any surface spotless, including metal, granite, glass, and wood. (*when wet vs. our dry towel) (**vs the leading value brand)",
  "price": {
    "value": 7.49,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CKWMSSC7"
},
{
  "title": "Bounty Essentials Select-A-Size Paper Towels, White, 2 Triple Rolls = 6 Regular Rolls (Packaging May Vary)",
  "asin": "B0CV4GS3F2",
  "brand": "Bounty",
  "stars": 4.6,
  "reviewsCount": 12100,
  "thumbnailImage": "https://m.media-amazon.com/images/I/81nvHa9XcyL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Cheap stuff not holding up? That’s why we made Bounty Essentials, where high performance meets low cost. This pack contains Bounty Essentials Select-A-Size white paper towels that are strong enough to handle multiple messes and soft enough to use on your family. And with Select-A-Size sheets you can decide how much you use depending on your mess. Affordable durability for everyday messes.",
  "price": {
    "value": 4.97,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0CV4GS3F2"
},
{
  "title": "Brawny Tear-A-Square 3-Ply Paper Towels, 6 Double Rolls = 12 Regular Rolls, Strong, Absorbent, and Durable with 3 Sheet Sizes (Quarter, Half, Full)",
  "asin": "B0DFHMZ922",
  "brand": "Brawny",
  "stars": 4.8,
  "reviewsCount": 3444,
  "thumbnailImage": "https://m.media-amazon.com/images/I/71KKz1zfghL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Introducing the Brawny 3-Ply Tear-A-Square Paper Towels — the ultimate solution for all your cleaning challenges. These premium paper towels offer unparalleled strength and absorbency versus other nationally branded retail paper towels, designed to handle everything from minor spills to heavy-duty cleanups with ease. Featuring the innovative Tear-A-Square design, you can select the perfect paper towel size — Quarter, Half, or Full — to match the task at hand, minimizing waste and maximizing efficiency. Imagine the simplicity of having just the right amount of paper towel at your fingertips. Each paper towel roll is crafted to provide more sheets than our regular rolls, ensuring you can change rolls less frequently, making it as convenient as it is effective. Certified by the Sustainable Forestry Initiative, these paper towels reflect a commitment to responsible sourcing and environmental stewardship. Brawny 3-Ply Paper Towels offer superior durability and absorbency versus national branded retail paper towel rolls, great for any cleaning scenario — whether in the home, car, or outdoors. From wiping down kitchen counters to cleaning up after pets, these strong paper towels are made to deliver reliable performance every time. Experience the peace of mind that comes with having a powerful cleaning ally in your household. Choose Brawny 3-Ply Tear-A-Square Paper Towels for a responsible and reliable solution that meets all your cleaning needs. Experience the difference today.",
  "price": {
    "value": 10.58,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B0DFHMZ922"
},
{
  "title": "AmazonCommercial 2-Ply White XL Multifold Paper Towels (SOFI-039)|Bulk for Business |Compatible with Universal Dispensers|FSC Certified |115 Sheets per Pack (16 Packs)(12.6 x 9.1 Sheet)",
  "asin": "B07TTK59BD",
  "brand": "AmazonCommercial",
  "stars": 4.4,
  "reviewsCount": 1500,
  "thumbnailImage": "https://m.media-amazon.com/images/I/31wm9ga1CXL._SX342_SY445_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "This AmazonCommercial 2-Ply White XL Multifold Paper Towel Pack contains (16) Multifold Paper Towel Packs (150, 9.5' x 9.25' sheets per pack, 2,400 sheets total). A hand towel designed with small and large businesses in mind that wish to provide customers with an improved restroom and kitchen image. We make set up and refilling easy, as our product works with any multifold universal dispenser.",
  "price": {
    "value": 27.29,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07TTK59BD"
},
{
  "title": "365 by Whole Foods Market, 100% Recycled Jumbo Paper Towels, Ultra-Strong, 135 Sheets per Roll, 1 Count",
  "asin": "B07QLXQPR8",
  "brand": "365 by Whole Foods Market",
  "stars": 4.4,
  "reviewsCount": 13859,
  "thumbnailImage": "https://m.media-amazon.com/images/I/5193AWZT0WL._AC_SY300_SX300_QL70_FMwebp_.jpg",
  "breadCrumbs": "Health & Household > Household Supplies > Paper & Plastic > Paper Towels",
  "description": "Our 365 brand products give you that dance-down-the-aisles feeling. Discover a huge range of choices with high-quality ingredients at prices you'll love. We take pride in what we do sell and even more in what we don’t. From our industry-leading sourcing standards, including sustainable wild-caught seafood and animal welfare, to the 550+ ingredients we ban across food and beverages, supplements, body care and household cleaning products, we continually raise our standards.",
  "price": {
    "value": 1.68,
    "currency": "$"
  },
  "url": "https://www.amazon.com/dp/B07QLXQPR8"
}]